Revit 2026 API
ExternalResourceBrowserData.AddResource Method
Overload List
Name | Description
AddResource(String) |  Adds an external resource to the folder path by supplying the resource name.
AddResource(String, IDictionary<String, String>)
AddResource(String, String) |  Adds an external resource to the folder path by supplying the resource name and version.
AddResource(String, String, IDictionary<String, String>)
Top
See Also
Reference
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace